Revit 2027 API
MarginType Enumeration
 An enumerated type listing all Margin types of Print Setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MarginType
Public Enumeration MarginType
public enum class MarginType
type MarginType
Members
Member name | Value | Description
NoMargin | 0 |  The type of Margin is No Margin.
PrinterLimit | 1 |  The type of Margin is Printer Limit.
UserDefined | 2 |  The type of Margin is User Defined.
See Also
Reference
Autodesk.Revit.DB Namespace